app/controllers/journals_controller.rb

SELECT "journals".* FROM "journals"   ORDER BY "journals"."updated_at" DESC
---
	def index
		@journals = Journal.all

INSERT INTO "journals" ("content", "title") VALUES (?, ?)
---
	def create
		if !params[:journal][:title].blank? and !params[:journal][:content].blank?
			journal = Journal.new(permit_params)
			journal.save