app/controllers/words_controller.rb

	def index
		@word = Word.new
		words = Word.all.order(:word)
---
SELECT "words".* FROM "words"   ORDER BY "words"."word" ASC

	def create
		if !params[:word][:word].blank? and !params[:word][:explanation].blank?
			word = Word.new(permit_params)
			word.prefix = word.word[0].upcase
			word.save
---
INSERT INTO "words" ("explanation", "prefix", "word") VALUES (?, ?, ?)  [["explanation", "傲慢、自大、骄气\r\nIt's different from 'pride'."], ["prefix", "A"], ["word", "arrogance"]]

	def destroy
		word = Word.find(params[:id])
		word.destroy if word
---
SELECT  "words".* FROM "words"  WHERE "words"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 1]]